Autodesk.Revit.DB.Structure.StructuralSections.StructuralSection.GetBoundarySize
Returns size of the section boundary.
Returns:
Size of the section boundary.
Since:
2015

Autodesk.Revit.DB.Structure.StructuralSections.StructuralSection.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.Structure.StructuralSections.StructuralSection.ShearAreaWeakAxis
Shear area (reduced extreme shear stress coefficient) in the direction of weak axis (Wq).
Since:
2015

Autodesk.Revit.DB.Structure.StructuralSections.StructuralSection.ShearAreaStrongAxis
Shear area (reduced extreme shear stress coefficient) in the direction of strong axis (Wq).
Since:
2015

Autodesk.Revit.DB.Structure.StructuralSections.StructuralSection.WarpingConstant
Warping constant (Cw, Iomega, H).
Since:
2015

Autodesk.Revit.DB.Structure.StructuralSections.StructuralSection.TorsionalModulus
Section modulus for calculations of torsion stresses (Ct).
Since:
2015

Autodesk.Revit.DB.Structure.StructuralSections.StructuralSection.TorsionalMomentOfInertia
Torsional Moment of inertia (J, IT, K), for calculation of torsional deformation
Since:
2015

Autodesk.Revit.DB.Structure.StructuralSections.StructuralSection.PlasticModulusWeakAxis
Plastic section modulus in bending about main weak axis.
Since:
2015

Autodesk.Revit.DB.Structure.StructuralSections.StructuralSection.PlasticModulusStrongAxis
Plastic section modulus in bending about main strong axis (Z, Wpl).
Since:
2015

Autodesk.Revit.DB.Structure.StructuralSections.StructuralSection.ElasticModulusWeakAxis
Elastic section modulus about main weak axis for calculation of bending stresses.
Since:
2015

Autodesk.Revit.DB.Structure.StructuralSections.StructuralSection.ElasticModulusStrongAxis
Elastic section modulus about main strong axis for calculation of bending stresses.
Since:
2015

Autodesk.Revit.DB.Structure.StructuralSections.StructuralSection.MomentOfInertiaWeakAxis
Moment of Inertia about main weak axis (I).
Since:
2015

Autodesk.Revit.DB.Structure.StructuralSections.StructuralSection.MomentOfInertiaStrongAxis
Moment of Inertia about main strong axis (I).
Since:
2015

Autodesk.Revit.DB.Structure.StructuralSections.StructuralSection.NominalWeight
Unit weight (not mass) per unit length, for self-weight calculation or quantity survey.
Since:
2015

Autodesk.Revit.DB.Structure.StructuralSections.StructuralSection.Perimeter
Painting surface of the unit length.
Since:
2015

Autodesk.Revit.DB.Structure.StructuralSections.StructuralSection.SectionArea
Cross section area.
Since:
2015

Autodesk.Revit.DB.Structure.StructuralSections.StructuralSection.PrincipalAxesAngle
Rotation angle between the principal axes and cross section reference planes.
Since:
2015

Autodesk.Revit.DB.Structure.StructuralSections.StructuralSection.StructuralSectionShapeName
A human readable string representing the structural section shape.
Since:
2015

Autodesk.Revit.DB.Structure.StructuralSections.StructuralSection.StructuralSectionGeneralShape
The general type of structural section shape.
Since:
2015

Autodesk.Revit.DB.Structure.StructuralSections.StructuralSection.StructuralSectionShape
The type of structural section shape.
Since:
2015

Autodesk.Revit.DB.Structure.StructuralSections.StructuralSection.AnalysisParams
Common set of parameters for structural analysis.
Since:
2015

Autodesk.Revit.DB.Structure.StructuralSections.StructuralSection.SectionNameKey
A parameter in structural families which allows for family type identification.
This will be used for data mapping during model exchange with another program, namely Advance Steel.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Since:
2015

Autodesk.Revit.DB.Structure.StructuralSections.StructuralSection
The base class for StructuralSection specific classes, designed to provide common parameters and ability to differentiate between different structural section shapes.
Since:
2015